artilleryTest.txt
Phase started: unnamed (index: 0, duration: 1s) 18:47:57(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 18:47:58(-0300)

--------------------------------------
Metrics for period to: 18:48:00(-0300) (width: 2.744s)
--------------------------------------

http.codes.200: ................................................................ 822
http.request_rate: ............................................................. 315/sec
http.requests: ................................................................. 855
http.response_time:
  min: ......................................................................... 10
  max: ......................................................................... 290
  median: ...................................................................... 125.2
  p95: ......................................................................... 186.8
  p99: ......................................................................... 206.5
http.responses: ................................................................ 822
vusers.completed: .............................................................. 16
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1523.1
  max: ......................................................................... 2425.8
  median: ...................................................................... 2018.7
  p95: ......................................................................... 2416.8
  p99: ......................................................................... 2416.8


--------------------------------------
Metrics for period to: 18:48:10(-0300) (width: 0.438s)
--------------------------------------

http.codes.200: ................................................................ 178
http.request_rate: ............................................................. 145/sec
http.requests: ................................................................. 145
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 98
  median: ...................................................................... 70.1
  p95: ......................................................................... 96.6
  p99: ......................................................................... 96.6
http.responses: ................................................................ 178
vusers.completed: .............................................................. 34
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2208.3
  max: ......................................................................... 2494.4
  median: ...................................................................... 2416.8
  p95: ......................................................................... 2465.6
  p99: ......................................................................... 2465.6


All VUs finished. Total time: 5 seconds

--------------------------------
Summary report @ 18:48:02(-0300)
--------------------------------

http.codes.200: ................................................................ 1000
http.request_rate: ............................................................. 230/sec
http.requests: ................................................................. 1000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 290
  median: ...................................................................... 115.6
  p95: ......................................................................... 186.8
  p99: ......................................................................... 206.5
http.responses: ................................................................ 1000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1523.1
  max: ......................................................................... 2494.4
  median: ...................................................................... 2369
  p95: ......................................................................... 2465.6
  p99: ......................................................................... 2465.6